# Install Homebrew
#   /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
#
# Then run: brew bundle
#

# Repository tools
brew "subversion"
brew "git"
brew "git-gui"
brew "tig"
brew "gh"
brew "gist"
brew "hub"

# Development tools
brew "watchman"
brew "watch"
brew "jq"
brew "apktool"

# Ruby tools
brew "ruby-build"
brew "rbenv"

# Node
brew "n"
brew "yarn"

# Databases
brew "postgresql"
brew "mysql"
brew "sqlite"
brew "redis"

# Terminal tools
brew "ack"
brew "awk"
brew "calc"
brew "coreutils"
brew "ffmpeg"
brew "grep"
brew "hstr"
brew "htop"
brew "imagemagick"
brew "mas"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

# Docker
brew "docker"
brew "docker-compose"
cask "docker"
cask "docker-toolbox"
brew "whalebrew"

# CLIs
brew "circleci"
brew "awscli"

# brew install --cask

cask "caffeine"
cask "dash"
cask "diffmerge"
cask "firefox"
cask "geektool"
cask "google-chrome"
cask "handbrake"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "macdown"
cask "postman"
cask "provisionql"
cask "rectangle"
cask "signal"
# cask "skitch"
cask "slack"
cask "sourcetree"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "zoom"

# Editors/IDEs
# cask "sublime-text"
cask "visual-studio-code"
cask "jetbrains-toolbox"
# cask "intellij-idea"
# cask "intellij-idea-ce"
# cask "phpstorm"
# cask "webstorm"
# cask "rubymine"

# Android
# brew "gradle"
cask "temurin" # openjdk
# cask "android-sdk"
# cask "android-ndk"
cask "android-studio"

# Looks interesting:
# XcodesApp
# https://github.com/RobotsAndPencils/XcodesApp
# https://github.com/RobotsAndPencils/xcodes
# cask "xcodes"
# cask "xcodesapp"

